w4d3/Ninety_Nine_Cats/app/views/cats/show.html.erb


<% unless @cat.rental_requests.empty? %>
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = ?  [["cat_id", 5]]
SELECT 1 AS one FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = ? LIMIT 1  [["cat_id", 3]]

        <th>Rental Requester:</th>
        <td> <%= User.find(rental.user_id).username %></td>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 5]]


<% if current_user.cats.include?(@cat) %>
---
SELECT 1 AS one FROM "cats" WHERE "cats"."user_id" = ? AND "cats"."id" = 3 LIMIT 1  [["user_id", 7]]