w4d3/Ninety_Nine_Cats/app/controllers/cat_rental_requests_controller.rb

SELECT "cat_rental_requests".* FROM "cat_rental_requests"
---
  def index
    @requests = CatRentalRequest.all

INSERT INTO "cat_rental_requests" ("cat_id", "created_at", "end_date", "start_date", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cat_id", 9], ["created_at", Tue, 20 Oct 2015 21:56:12 UTC +00:00], ["end_date", Thu, 15 Oct 2015], ["start_date", Wed, 14 Oct 2015], ["updated_at", Tue, 20 Oct 2015 21:56:12 UTC +00:00]]
---
  def create
    @request = CatRentalRequest.new(rental_params)
    @request.user_id = current_user.id

    if @request.save