w4d2/Ninety_Nine_Cats/app/views/cat_rental_requests/new.html.erb


    <%Cat.all.each do |cat|%>
---
SELECT "cats".* FROM "cats"