w4d5/Beddit/app/controllers/posts_controller.rb

  def new
    @sub = Sub.find(params[:sub_id])
    @post = Post.new(sub_id: @sub.id, author_id: @sub.moderator_id)
    @author = User.find(@post.author_id)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "content", "author_id", "sub_id", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"