w4d5/Beddit/app/controllers/subs_controller.rb

  def new
    @moderator = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", nil]]

  def create
    @sub = Sub.new(sub_params)
    if @sub.save
---
INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "11111FFFFIRST"], ["description", "  dfgBEDDDDITITIWEG"], ["moderator_id", 4], ["created_at", "2015-10-23 20:30:18.700453"], ["updated_at", "2015-10-23 20:30:18.700453"]]

  def update
    @sub = Sub.find(params[:id])

    if @sub.update(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "EDIT THE BEDDIT"], ["updated_at", "2015-10-23 20:50:16.529332"], ["id", 2]]

  def destroy
    @sub = Sub.find(params[:id])
    @sub.destroy
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "subs" WHERE "subs"."id" = $1  [["id", 3]]