w4d2/Ninety_Nine_Cats/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "created_at", "description", "name", "sex", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @cat = Cat.new(cat_params)

    if @cat.save

SELECT "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "cats" SET "birth_date" = ?, "description" = ?, "updated_at" = ? WHERE "cats"."id" = 3  [["birth_date", Wed, 14 Oct 2015], ["description", "Lazy and loves lasagna!"], ["updated_at", Tue, 20 Oct 2015 18:57:59 UTC +00:00]]
---
  def update
    @cat = Cat.find(params[:id])

    if @cat.update(cat_params)