w4d1/RoutesandControllers/app/controllers/contacts_controller.rb

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    contact = Contact.find(params[:id])

INSERT INTO "contacts" ("name", "email", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Iceland"], ["email", "ice@land.com"], ["user_id", 4], ["created_at", "2015-10-19 20:49:15.769294"], ["updated_at", "2015-10-19 20:49:15.769294"]]
---
  def create
    contact = Contact.new(contact_params)
    if contact.save

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "contacts" SET "email" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["email", "r@berto.com"], ["updated_at", "2015-10-19 20:47:22.307216"], ["id", 1]]
---
  def update
    contact = Contact.find(params[:id])
    contact.update(contact_params)