w4d1/RoutesandControllers/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Greenland"], ["email", "green@land.com"], ["created_at", "2015-10-19 18:13:38.172843"], ["updated_at", "2015-10-19 18:13:38.172843"]]
---
  def create
    user = User.new(user_params)
    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "icy@land.com"], ["updated_at", "2015-10-19 18:39:10.590763"], ["id", 4]]
---
  def update
    user = User.find(params[:id])
    user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "users" WHERE "users"."id" = 4
---
  def destroy
    user = User.find(params[:id])
    User.delete(user)