w4d2/Ninety_Nine_Cats/app/views/cats/show.html.erb

<strong><u>  Rental Requests</strong></u>
<%@cat.rental_requests.each do |rental|%>
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = ?  [["cat_id", 5]]