w4d4/MusicApp/app/controllers/bands_controller.rb

INSERT INTO "bands" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Cuatro Pajaros"], ["created_at", "2015-10-22 21:37:58.850118"], ["updated_at", "2015-10-22 21:37:58.850118"]]
---
  def create
    @band = Band.new(band_params)

    if @band.save!