w4d4/MusicApp/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

DELETE FROM "users" WHERE "users"."id" = 9
---
  def destroy
    User.delete(current_user)